Fark0910/Nutriscan_ESP32Cam_Setup/app_httpd.cpp
//=========================================================================================================================================================
//Send to nutri server function
//=========================================================================================================================================================
void sendToNutriServer(const char* ean, const char* wifipass) {
  if (WiFi.status() != WL_CONNECTED) {
    Serial.println("WiFi not connected!");
    return;
  }

  HTTPClient http;
  http.setTimeout(20000);                  //important

  String url = "http://" + String(nutriServerHost) + ":" + String(nutriServerPort) + "/nutri?ean=" + String(ean) + "&wifiid=" + String(wifipass);  ///nutri is actually the defined route in express.js which is being accessed
  Serial.print("Requesting URL: ");
  Serial.println(url);

  http.begin(url);
  int httpCode = http.GET();

  if (httpCode > 0) {
    Serial.printf("Nutri Server Response code: %d\n", httpCode);
    String payload = http.getString();
    Serial.println("Response payload:");
    Serial.println(payload);

//=========================================================================================================================================================
//CHECKING THE FLAG VALUE FROM JSON RESPONSE SEND BY "/nutri" if the product is safe turns on green led else turn on red
//=========================================================================================================================================================
    StaticJsonDocument<512> doc;
    DeserializationError error = deserializeJson(doc, payload);
    if (error) {
      Serial.print("Failed to parse Nutri response: ");
      Serial.println(error.f_str());
      return;
    }

// Access the flag inside esp.alerts[0].flag 
    if (!doc["esp"].isNull() && doc["esp"]["alerts"].is<JsonArray>()) {
      JsonArray alerts = doc["esp"]["alerts"].as<JsonArray>();
      if (alerts.size() > 0 && alerts[0]["flag"]) {
        const char* flag = alerts[0]["flag"];
        if (strcmp(flag, "safe") == 0) {
          Serial.println("Product is safe — GREEN LED ON");
          digitalWrite(GREEN_LED_PIN, HIGH);
          delay(4000);
          digitalWrite(GREEN_LED_PIN, LOW);} 
        else {
          Serial.println("Product is NOT safe — RED LED ON");
          digitalWrite(RED_LED_PIN, HIGH);
          delay(4000);
          digitalWrite(RED_LED_PIN, LOW);
        }
      } 
      else {
        Serial.println("No alerts or flag missing.");
      }
    } 
    else {
      Serial.println("ESP object or alerts array missing.");
  }}

  else{
    Serial.printf("GET request failed: %s\n", http.errorToString(httpCode).c_str());
  }
   

  http.end();
}
//=========================================================================================================================================================
//Send captured image to barcode reader function 
//=========================================================================================================================================================
void sendCapturedImageToServer(uint8_t* imageData, size_t imageLen) {
  if (WiFi.status() != WL_CONNECTED) {
    Serial.println("WiFi not connected!");
    return;
  }
  
  WiFiClientSecure client;                   //if you are using local code for barcode reader and not render deployed one then simply use " WiFiClient client;"
  client.setInsecure();              //render uses https its important to mention this line for local testing ignore it
  client.setTimeout(40000);        //its Important to add this much timout due to "render" server response time
 

  if (!client.connect(serverUrl, serverPort)) {
    Serial.println("Connection to server failed!");
    return;
  }

  Serial.println("Connected to server!");
//=========================================================================================================================================================
//set headers for request
//=========================================================================================================================================================
  String boundary = "----WebKitFormBoundary7MA4YWxkTrZu0gW";

  String startRequest = "--" + boundary + "\r\n";
  startRequest += "Content-Disposition: form-data; name=\"file\"; filename=\"image.jpg\"\r\n";
  startRequest += "Content-Type: image/jpeg\r\n\r\n";

  String endRequest = "\r\n--" + boundary + "--\r\n";

  int contentLength = startRequest.length() + imageLen + endRequest.length();

//=========================================================================================================================================================
//Send http header to barcodedecoder.onrender.com/decode
//=========================================================================================================================================================
  client.println("POST /decode HTTP/1.1");
  client.println("Host: barcodedecoder.onrender.com");
  client.println("Content-Type: multipart/form-data; boundary=" + boundary);
  client.println("Content-Length: " + String(contentLength));
  client.println(); // Empty line to end headers

  // Send multipart body
  client.print(startRequest);  // Starting boundary
//=========================================================================================================================================================
//Image cannot be send directly send it in 512 bytes chunks esp32 might crash aur show guru mediation error trying to send at once due to space issue 
//at end pointi.e. /decode image bytes are merged and evaluated 
//=========================================================================================================================================================
  const size_t chunkSize = 512; // 512 bytes safe chunk
  size_t sent = 0;
  while (sent < imageLen) {
    size_t thisChunkSize = ((sent + chunkSize) > imageLen) ? (imageLen - sent) : chunkSize;
    client.write(&imageData[sent], thisChunkSize);
    sent += thisChunkSize;
    delay(1);  // slight yield to WiFi stack
  }

  client.print(endRequest);  // Ending boundary

  // Wait for server response
  while (client.connected()) {
    String line = client.readStringUntil('\n');
    if (line == "\r") {
      break; // Headers done
    }
  }

  // Read body
  String response = client.readString();
  Serial.println("Server Response:");
  Serial.println(response);
//=========================================================================================================================================================
//Cleaning the response from /decode since it content unnecessary 0 after response 
//=========================================================================================================================================================
// Clean response before parsing
  int startIndex = response.indexOf('{');
  int endIndex = response.lastIndexOf('}');
  if (startIndex >= 0 && endIndex >= 0) {
    String cleanJson = response.substring(startIndex, endIndex + 1);
    
    StaticJsonDocument<300> doc;  // Important
    DeserializationError error = deserializeJson(doc, cleanJson);//important

    if (error) {
      Serial.print("Failed to parse JSON: ");
      Serial.println(error.f_str());
      return;
    }

