Fark0910/Nutriscan_ESP32Cam_Setup/app_httpd.cpp
    const char* ean = doc["barcodes"][0]["text"];
    Serial.print("EAN Number: ");
    Serial.println(ean);
//=========================================================================================================================================================
//Send to /nutri server defined in express.js both ean number and wifi pass this wifipass will be checked for given user in middleware of /nutri server
//=========================================================================================================================================================
    sendToNutriServer(ean,wifipass);  

} else {
    Serial.println("Invalid JSON structure received!");
}}
/*
#include "FS.h"
#include "SD_MMC.h"*/
#include "SPI.h"
//=========================================================================================================================================================
//Small tweaks in capture handler (capture button will be present on camserver route(UI) and this function handle it) 
//added RGB565 to jpeg conversion(very much important else your image will be null always)
//tested image saving in SD card(optional)
//=========================================================================================================================================================
static esp_err_t capture_handler(httpd_req_t *req) {
  camera_fb_t *fb = NULL;
  esp_err_t res = ESP_OK;

  int64_t fr_start = esp_timer_get_time();
  fb = esp_camera_fb_get();
  if (!fb) {
    log_e("Camera capture failed");
    httpd_resp_send_500(req);
    return ESP_FAIL;
  }
//=========================================================================================================================================================
//CHECK FORMAT OF CAPTURED IMAGE FROM MY RHXY IT SUPPORT RGB
//=========================================================================================================================================================
  Serial.println(fb->format == PIXFORMAT_JPEG ? "JPEG format" : "RGB/YUV format");
  //=========================================================================================================================================================
//Save to Sd card (optional)
//=========================================================================================================================================================
/*
  if (!SD_MMC.begin()) {
    Serial.println("SD Card mount failed");
    esp_camera_fb_return(fb);
    httpd_resp_send_500(req);
    return ESP_FAIL;
  }*/

  //=========================================================================================================================================================
//Conversion to JPEG
//=========================================================================================================================================================
  // Convert to JPEG if needed
  uint8_t *jpeg_buf = NULL;
  size_t jpeg_len = 0;
  bool converted = false;

  if (fb->format == PIXFORMAT_JPEG) {
    jpeg_buf = fb->buf;
    jpeg_len = fb->len;
  } else {
    if (!frame2jpg(fb, 80, &jpeg_buf, &jpeg_len)) {
      Serial.println("JPEG compression failed");
      esp_camera_fb_return(fb);
      httpd_resp_send_500(req);
      return ESP_FAIL;
    }
    converted = true;
  }
  /*
  // Save to SDCARD
  File file = SD_MMC.open("/capture.jpg", FILE_APPEND);// save as capture.jpg each time capture button is clicked this will overwrite
  if (!file) {
    Serial.println("Failed to open file for writing");
    if (converted && jpeg_buf) free(jpeg_buf);
    esp_camera_fb_return(fb);
    httpd_resp_send_500(req);
    return ESP_FAIL;
  }
  file.write(jpeg_buf, jpeg_len);
  file.close();*/
  Serial.printf("Saved JPEG image (%d bytes) to /capture.jpg\n", jpeg_len);
  //=========================================================================================================================================================
//Finally sending to sendCapturedImageToServer pass jpeg buff and jpeg length in params
//=========================================================================================================================================================
  sendCapturedImageToServer(jpeg_buf,jpeg_len);
  // Web response
  httpd_resp_set_type(req, "image/jpeg");
  httpd_resp_set_hdr(req, "Content-Disposition", "inline; filename=capture.jpg");
  res = httpd_resp_send(req, (const char *)jpeg_buf, jpeg_len);

  // Clean up the buffer 
  if (converted && jpeg_buf) {
    free(jpeg_buf);
  }
  esp_camera_fb_return(fb);

  int64_t fr_end = esp_timer_get_time();
  log_i("JPEG: %uB %ums", (uint32_t)(jpeg_len), (uint32_t)((fr_end - fr_start) / 1000));

  return res;
}

static esp_err_t stream_handler(httpd_req_t *req) {
  camera_fb_t *fb = NULL;
  struct timeval _timestamp;
  esp_err_t res = ESP_OK;
  size_t _jpg_buf_len = 0;
  uint8_t *_jpg_buf = NULL;
  char *part_buf[128];

  static int64_t last_frame = 0;
  if (!last_frame) {
    last_frame = esp_timer_get_time();
  }

  res = httpd_resp_set_type(req, _STREAM_CONTENT_TYPE);
  if (res != ESP_OK) {
    return res;
  }

  httpd_resp_set_hdr(req, "Access-Control-Allow-Origin", "*");
  httpd_resp_set_hdr(req, "X-Framerate", "60");

#if CONFIG_LED_ILLUMINATOR_ENABLED
  isStreaming = true;
  enable_led(true);
#endif

  while (true) {
    fb = esp_camera_fb_get();
    if (!fb) {
      log_e("Camera capture failed");
      res = ESP_FAIL;
    } else {
      _timestamp.tv_sec = fb->timestamp.tv_sec;
      _timestamp.tv_usec = fb->timestamp.tv_usec;
      if (fb->format != PIXFORMAT_JPEG) {
        bool jpeg_converted = frame2jpg(fb, 80, &_jpg_buf, &_jpg_buf_len);
        esp_camera_fb_return(fb);
        fb = NULL;
        if (!jpeg_converted) {
          log_e("JPEG compression failed");
          res = ESP_FAIL;
        }
      } else {
        _jpg_buf_len = fb->len;
        _jpg_buf = fb->buf;
      }
    }
    if (res == ESP_OK) {
      res = httpd_resp_send_chunk(req, _STREAM_BOUNDARY, strlen(_STREAM_BOUNDARY));
    }
    if (res == ESP_OK) {
      size_t hlen = snprintf((char *)part_buf, 128, _STREAM_PART, _jpg_buf_len, _timestamp.tv_sec, _timestamp.tv_usec);
      res = httpd_resp_send_chunk(req, (const char *)part_buf, hlen);
    }
    if (res == ESP_OK) {
      res = httpd_resp_send_chunk(req, (const char *)_jpg_buf, _jpg_buf_len);
    }
    if (fb) {
      esp_camera_fb_return(fb);
      fb = NULL;
      _jpg_buf = NULL;
    } else if (_jpg_buf) {
      free(_jpg_buf);
      _jpg_buf = NULL;
    }
    if (res != ESP_OK) {
      log_e("Send frame failed");
      break;
    }
    int64_t fr_end = esp_timer_get_time();

    int64_t frame_time = fr_end - last_frame;
    last_frame = fr_end;

    frame_time /= 1000;
#if ARDUHAL_LOG_LEVEL >= ARDUHAL_LOG_LEVEL_INFO
    uint32_t avg_frame_time = ra_filter_run(&ra_filter, frame_time);
#endif
    log_i(
      "MJPG: %uB %ums (%.1ffps), AVG: %ums (%.1ffps)", (uint32_t)(_jpg_buf_len), (uint32_t)frame_time, 1000.0 / (uint32_t)frame_time, avg_frame_time,
      1000.0 / avg_frame_time
    );
  }

#if CONFIG_LED_ILLUMINATOR_ENABLED
  isStreaming = false;
  enable_led(false);
#endif

  return res;
}

